app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
  def post
    @author = Author.find(params[:id])